python, numpy, pandas 날짜 타입 비교 및 정리
https://ellun.tistory.com/320

In [23]:
# timestamp -> str
import time
print(time.time())
type(time.time())
timestamp = time.time()
s = str(timestamp)
print(s,type(s))

1626747680.643179
1626747680.643253 <class 'str'>

In [24]:
#datetime -> str
from datetime import datetime
s = datetime.now()
print(s,type(s))

s1 = datetime.now().strftime('%Y-%m-%d %H:%M:%S')
print(s1,type(s1))

2021-07-20 11:21:20.682763 <class 'datetime.datetime'>
2021-07-20 11:21:20 <class 'str'>

In [25]:
# str -> datetime
from datetime import datetime
s = '2021-07-20 11:14:08'
d = datetime.strptime(s,'%Y-%m-%d %H:%M:%S') #strptime = 시간대로 파싱
print(d,type(d))

2021-07-20 11:14:08 <class 'datetime.datetime'>

In [27]:
# str -> timestamp
s = '2021-07-20 11:14:08'
timestamp = time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple())
print(timestamp,type(timestamp))

1626747248.0 <class 'float'>

In [29]:
#datetime -> timestamp
timestamp = time.mktime(datetime.today().timetuple())
print(timestamp,type(timestamp))

1626747986.0 <class 'float'>

In [32]:
# timestamp -> datetime
t = time.time()
d = datetime.fromtimestamp(t)
print(d,type(d))

2021-07-20 11:28:50.568603 <class 'datetime.datetime'>

In [66]:
# 판다스 to_datetime
pd.to_datetime(1626747986.0,unit='s')

Timestamp('2021-07-20 02:26:26')

In [33]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now = datetime.now()
delta_datetime = timedelta(days=-365)
print(delta_datetime)
datetime_now + delta_datetime

-365 days, 0:00:00

datetime.datetime(2020, 7, 20, 11, 31, 53, 521715)

In [35]:
# 두 날짜간의 일 수 구하기
since_timestamp = datetime.strptime('20180301','%Y%m%d')
until_timestamp = datetime.strptime('20180331','%Y%m%d')

result = until_timestamp - since_timestamp
result

datetime.timedelta(days=30)

In [36]:
# 특정 날짜 요일 구하기
import datetime
def get_yoil(y,m,d):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()]

get_yoil(2021,7,20)

'TUE'

In [37]:
#pandas Timestamp
import pandas as pd
date = pd.Timestamp(1626747986.0,unit='s',tz='Asia/Seoul')
# unit ='s' = seconds / 한국 시간 설정
print(date,type(date))

2021-07-20 11:26:26+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [56]:
df = pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [58]:
df['New_Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [59]:
df.drop('Date',axis=1,inplace=True)
df['Year'] = df['New_Date'].dt.year
df['Month'] = df['New_Date'].dt.month
df['Day'] = df['New_Date'].dt.day
df.head()

   Close  Start   High    Low  Volume   New_Date  Year  Month  Day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [60]:
df.set_index('New_Date',inplace=True)

df.head()

            Close  Start   High    Low  Volume  Year  Month  Day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [62]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [63]:
df_ymd_range = df['2018-06-29':'2018-06-26']
df_ymd_range

Empty DataFrame
Columns: [Close, Start, High, Low, Volume, Year, Month, Day]
Index: []

In [65]:
df_ym = df.loc['2018-07','Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [109]:
# Time Series Basics
# 인덱스별로 랜덤 값을 넘겨줌
from datetime import datetime
import numpy as np
dates = [datetime(2011,1,2),datetime(2011,1,5),
    datetime(2011,1,7),datetime(2011,1,8),
    datetime(2011,1,10),datetime(2011,1,12)]

ts = pd.Series(np.random.randn(6),index=dates) # randn = 정규분포
ts

2011-01-02   -0.590374
2011-01-05    1.523764
2011-01-07    1.503000
2011-01-08    0.172471
2011-01-10    0.682060
2011-01-12    0.592146
dtype: float64

In [99]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [110]:
ts[::2]

2011-01-02   -0.590374
2011-01-07    1.503000
2011-01-10    0.682060
dtype: float64

In [115]:
ts + ts[::2]

2011-01-02   -1.180749
2011-01-05         NaN
2011-01-07    3.006000
2011-01-08         NaN
2011-01-10    1.364121
2011-01-12         NaN
dtype: float64

In [116]:
ts.add(ts[::2], fill_value=0)

2011-01-02   -1.180749
2011-01-05    1.523764
2011-01-07    3.006000
2011-01-08    0.172471
2011-01-10    1.364121
2011-01-12    0.592146
dtype: float64

In [117]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [118]:
stamp = ts.index[2]
ts[stamp]

1.5030002165675682

In [122]:
# 2011-01-10    1.364121  
print(ts['1/10/2011'])
ts['20110110']

0.6820603954951197

0.6820603954951197

In [124]:
longer_ts = pd.Series(np.random.randn(1000),index=pd.date_range('1/1/2000',periods=1000))
print(longer_ts,'\n')

2000-01-01    0.677385
2000-01-02   -0.013852
2000-01-03   -0.889416
2000-01-04   -0.640103
2000-01-05   -0.629056
                ...
2002-09-22   -0.355064
2002-09-23   -0.556072
2002-09-24    1.371954
2002-09-25   -0.537658
2002-09-26   -0.702661
Freq: D, Length: 1000, dtype: float64

In [129]:
longer_ts['2001'] # 년도만 선택하면 해당 연도의 데이터만 나옴
longer_ts['2001-05'][:5] # 해당 년월 데이터 출력 / 인덱싱 가능

2001-05-01   -0.929643
2001-05-02    0.016439
2001-05-03   -0.817872
2001-05-04   -0.485542
2001-05-05    0.510164
Freq: D, dtype: float64

In [131]:
ts[datetime(2011,1,7):] # 슬라이싱도 가능

2011-01-07    1.503000
2011-01-08    0.172471
2011-01-10    0.682060
2011-01-12    0.592146
dtype: float64

In [133]:
# truncate ~부터 ~까지
print(ts.truncate(before='2011-01-05',after='2011-01-10'))

2011-01-05    1.523764
2011-01-07    1.503000
2011-01-08    0.172471
2011-01-10    0.682060
dtype: float64

In [135]:
print(ts.truncate(after='1/9/2011')) # ~ 이전까지

2011-01-02   -0.590374
2011-01-05    1.523764
2011-01-07    1.503000
2011-01-08    0.172471
dtype: float64

In [136]:
pd.date_range('2020-10-7', '2020-10-20') # 날짜 인덱스 생성

DatetimeIndex(['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10',
               '2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15', '2020-10-16', '2020-10-17', '2020-10-18',
               '2020-10-19', '2020-10-20'],
              dtype='datetime64[ns]', freq='D')

In [139]:
from datetime import datetime
from datetime import timedelta

now = datetime.now()
in_two_weeks = now + timedelta(weeks=2)
pd.date_range(datetime.now(),in_two_weeks) # 2주치 날짜 인덱스 생성

DatetimeIndex(['2021-07-20 14:11:54.926633', '2021-07-21 14:11:54.926633',
               '2021-07-22 14:11:54.926633', '2021-07-23 14:11:54.926633',
               '2021-07-24 14:11:54.926633', '2021-07-25 14:11:54.926633',
               '2021-07-26 14:11:54.926633', '2021-07-27 14:11:54.926633',
               '2021-07-28 14:11:54.926633', '2021-07-29 14:11:54.926633',
               '2021-07-30 14:11:54.926633', '2021-07-31 14:11:54.926633',
               '2021-08-01 14:11:54.926633', '2021-08-02 14:11:54.926633'],
              dtype='datetime64[ns]', freq='D')

In [144]:
# periods 매개변수는 date_range 함수에 전달된 시작날짜와 종료날짜를
# periods 매개변수에 전달된 기준의 수 만큼 동일하게 시간단위까지 나눠서 출력
pd.date_range(start='2020-10-01',end='2020-10-20',periods=5) # periods = 5개의 기준

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [146]:
pd.date_range('2012-05-02 12:56:31',periods=5, normalize=True) # normalize=True : 날짜만 처리

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

freq 매개변수에 사용되는 Frequncy strings
- A >> calendar year end frequency
- B	>> business day frequency
- C	>> custom business day frequency
- D	>> calendar day frequency
- W	>> weekly frequency
- M	>> month end frequency
- SM >> semi-month end frequency (15th and end of month)
- BM >> business month end frequency
- CBM >> custom business month end frequency
- MS >> month start frequency
- SMS >> semi-month start frequency (1st and 15th)
- BMS >> business month start frequency
- CBMS >> custom business month start frequency
- Q >> quarter end frequency

In [148]:
import numpy as np
dates = pd.date_range('1/1/2000',periods=100,freq='W-WED') #freq 구간을 기준에 따라 나누고 싶을 때 
dates

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [153]:
import pandas as pd
long_df = pd.DataFrame(np.random.randn(100,4),index=dates, columns=['Colorado','Texas','New York','Ohio'])
print(long_df,'\n')
long_df.loc['2001-06']

            Colorado     Texas  New York      Ohio
2000-01-05  1.068845 -0.390806 -1.025920  0.278039
2000-01-12 -0.035008 -0.082005 -1.254696 -1.272163
2000-01-19  1.350033 -0.760622  0.530851  0.391543
2000-01-26  0.217389 -0.501333  0.020421 -1.710988
2000-02-02  2.653099 -0.635326  0.424839 -0.761174
...              ...       ...       ...       ...
2001-10-31  0.684424  1.093358 -2.077085  1.302126
2001-11-07  0.099540  0.507500 -0.158239  0.153028
2001-11-14  0.477195  0.154659 -1.203032  0.288366
2001-11-21 -1.158813 -0.313411  0.835803  1.212158
2001-11-28  0.835082 -0.793012 -0.341510  1.943278

[100 rows x 4 columns]

            Colorado     Texas  New York      Ohio
2001-06-06 -0.218287  0.385284  0.375460  0.019677
2001-06-13  1.738287 -0.277776  0.254612  0.456543
2001-06-20 -0.046163 -0.616634  0.679691  0.416667
2001-06-27 -2.612348 -0.152613 -1.649489 -1.398127

In [154]:
dates = pd.DatetimeIndex(['1/1/2000','1/2/2000','1/2/2000','1/2/2000','1/3/2000'])

dup_ts = pd.Series(np.arange(5),index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int64

In [157]:
dup_ts.index.is_unique

False

In [161]:
dup_ts['1/3/2000'] # not dulplicated의 경우 스칼라 값

4

In [160]:
dup_ts['1/2/2000'] # duplicated의 경우 슬라이스 출력

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int64

In [164]:
grouped = dup_ts.groupby(level=0)
print(grouped.mean())
print(grouped.count())

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64
2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [165]:
pd.date_range('2000-01-01','2000-01-03 23:59',freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [167]:
from pandas.tseries.offsets import Hour,Minute
Hour(2) + Minute(30)

In [168]:
pd.date_range('2000-01-01',periods=10,freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [173]:
rng = pd.date_range('2000-01-01','2012-09-01',freq='WOM-3FRI')
print(rng)

DatetimeIndex(['2000-01-21', '2000-02-18', '2000-03-17', '2000-04-21',
               '2000-05-19', '2000-06-16', '2000-07-21', '2000-08-18',
               '2000-09-15', '2000-10-20',
               ...
               '2011-11-18', '2011-12-16', '2012-01-20', '2012-02-17',
               '2012-03-16', '2012-04-20', '2012-05-18', '2012-06-15',
               '2012-07-20', '2012-08-17'],
              dtype='datetime64[ns]', length=152, freq='WOM-3FRI')

In [174]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011,11,17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [175]:
offset = MonthEnd()
print(offset.rollforward(now))
offset.rollback(now)

2011-11-30 00:00:00

Timestamp('2011-10-31 00:00:00')

In [184]:
ts = pd.Series(np.random.randn(20),index=pd.date_range('1/15/2000',periods=20, freq='4d'))
print(ts)

2000-01-15   -0.156516
2000-01-19    0.020594
2000-01-23    0.584253
2000-01-27   -0.715735
2000-01-31    0.290195
2000-02-04   -0.177471
2000-02-08   -0.490379
2000-02-12   -0.899451
2000-02-16    1.339589
2000-02-20   -0.110029
2000-02-24    0.775995
2000-02-28   -0.213880
2000-03-03    0.093783
2000-03-07    1.347518
2000-03-11    1.763887
2000-03-15    0.575280
2000-03-19   -0.071645
2000-03-23   -0.991436
2000-03-27   -1.519064
2000-03-31    0.189915
Freq: 4D, dtype: float64

In [203]:
# 과제1
# offset.rollforward 기준으로 그룹화를 진행 후 그룹별 평균값을 출력하세요
data = ts.groupby(offset.rollforward)
data.mean()

2000-01-31    0.004558
2000-02-29    0.032054
2000-03-31    0.173530
dtype: float64

In [209]:
# 과제2
# 상기 문제를 resample을 사용하여 수행하세요.
data1 = ts.resample('1M')
data1.mean()

2000-01-31    0.004558
2000-02-29    0.032054
2000-03-31    0.173530
Freq: M, dtype: float64

In [436]:
# 과제3
# 날짜 데이터를 인덱스로 하는 5가지 이상의 컬럼을 포함하고 있는 데이터 셋을 생성하세요. (학원 출석 날짜, 출발시간, 금액, 등원시간, 하원시간, 요일 별 혼잡도)
# 단 각 컬럼은 인덱스별 의미있는 값을 갖도록 만든 후 다음을 수행하세요.
# - 특정 연별, 월별, 일별 특정 컬럼 값 집계
# - 인덱스를 실수형으로 변환
# - 인덱스의 포멧을 변환
from datetime import datetime as dt
import datetime
import pandas as pd
import numpy as np

def get_yoil(y):
    days = ['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.weekday(y)]

dates = pd.date_range('2021-07-21',periods=36,freq='3B')
d_time = pd.date_range('07:00','07:30',periods=36)
fare = np.random.randint(4100,5000,size=(36,1))
s_time = pd.date_range('01:40','02:10',periods=36)
e_time = pd.date_range('01:50','02:30',periods=36)

d_t = d_time.to_frame(index=False,name='출발시간')
s_t = s_time.to_frame(index=False,name='등원시간')
e_t = e_time.to_frame(index=False,name='하원시간')

# pd.DataFrame(['d_t','fare','s_t','e_t'],index=dates)
t_data = pd.concat([d_t,s_t,e_t],axis=1)

df = pd.DataFrame(fare,columns=['금액'])
df1 = pd.concat([df,t_data],axis=1,ignore_index=False)
df1['등원날짜'] = dates
result = df1.set_index('등원날짜')
result['출발시간'] = result['출발시간'].dt.time
result['등원시간'] = result['등원시간'].dt.time
result['하원시간'] = result['하원시간'].dt.time

tf =result['2021'].sum()
# result['혼잡도'] = result['2021'].dt.weekday_name
# result['금액'].astype(float)
# result['금액'].to_list

# datetimeindex들 값에 콤마가 붙어있어서 전처리를 한 후 자료형을 변경해야 됨
# pd.read_csv('파일명', thousands=',') 불러올 때 천 단위 콤마 제거

result['금액']
# numeric 사용해서 다시 한 번 풀어보기 # -------------------------------------------------------------------------

등원날짜
2021-07-21    4619
2021-07-26    4939
2021-07-29    4110
2021-08-03    4194
2021-08-06    4933
2021-08-11    4762
2021-08-16    4922
2021-08-19    4669
2021-08-24    4561
2021-08-27    4634
2021-09-01    4596
2021-09-06    4112
2021-09-09    4290
2021-09-14    4334
2021-09-17    4726
2021-09-22    4971
2021-09-27    4447
2021-09-30    4806
2021-10-05    4758
2021-10-08    4170
2021-10-13    4547
2021-10-18    4632
2021-10-21    4861
2021-10-26    4426
2021-10-29    4221
2021-11-03    4105
2021-11-08    4272
2021-11-11    4831
2021-11-16    4268
2021-11-19    4425
2021-11-24    4912
2021-11-29    4883
2021-12-02    4886
2021-12-07    4130
2021-12-10    4709
2021-12-15    4689
Name: 금액, dtype: int64

In [437]:
# Periods and Period Arithmetic
import pandas as pd
p = pd.Period(2007,freq='A-DEC') # 연말 기준
p

Period('2007', 'A-DEC')

In [438]:
print(p+5)

2012

In [439]:
p-2

Period('2005', 'A-DEC')

In [447]:
# 기간을 타임스탬프로 변환
import numpy as np
rng = pd.period_range('2000-01-01',periods=3,freq='M')
rng
ts = pd.Series(np.random.randn(3), index=rng)
print(ts,'\n')
ts.to_timestamp(how='end') # 월말 기준으로 timestamp

2000-01   -1.137985
2000-02    0.613069
2000-03   -0.522991
Freq: M, dtype: float64

2000-01-31 23:59:59.999999999   -1.137985
2000-02-29 23:59:59.999999999    0.613069
2000-03-31 23:59:59.999999999   -0.522991
dtype: float64

In [450]:
# Downsampling
rng = pd.date_range('2001-01-01',periods=12,freq='T') # T는 분 단위
ts = pd.Series(np.arange(12),index=rng)
ts

2001-01-01 00:00:00     0
2001-01-01 00:01:00     1
2001-01-01 00:02:00     2
2001-01-01 00:03:00     3
2001-01-01 00:04:00     4
2001-01-01 00:05:00     5
2001-01-01 00:06:00     6
2001-01-01 00:07:00     7
2001-01-01 00:08:00     8
2001-01-01 00:09:00     9
2001-01-01 00:10:00    10
2001-01-01 00:11:00    11
Freq: T, dtype: int64

In [453]:
ts.resample('5min',closed='right').sum() # close = 닫힌구간, 열린구간 개념
# 표시되는 값 ~ 그 다음 값

2000-12-31 23:55:00     0
2001-01-01 00:00:00    15
2001-01-01 00:05:00    40
2001-01-01 00:10:00    11
Freq: 5T, dtype: int64

In [459]:
ts.resample('5min').ohic()

AttributeError: 'DatetimeIndexResampler' object has no attribute 'ohic'

In [460]:
frame = pd.DataFrame(np.random.randn(2,4),
    index=pd.date_range('1/1/2000',periods=2,freq='W-WED'),
    columns=['Colorado','Texas','New York','Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05  1.523008  0.884130  1.930557 -0.245223
2000-01-12  0.664071  0.265214  2.739460  1.596986

In [461]:
df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05  1.523008  0.884130  1.930557 -0.245223
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.664071  0.265214  2.739460  1.596986

In [466]:
frame.resample('D').ffill(limit=2) #limit을 줘서 2개 까지만 채움

            Colorado     Texas  New York      Ohio
2000-01-05  1.523008  0.884130  1.930557 -0.245223
2000-01-06  1.523008  0.884130  1.930557 -0.245223
2000-01-07  1.523008  0.884130  1.930557 -0.245223
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.664071  0.265214  2.739460  1.596986